# 9)კომენტარის სახით ჩამოწერეთ სიის ყველა ფუნქცია
# და მიუწერეთ თ რომელი რას აკეთებს

#nums = [1, 2, 3, 3, 4, 4, 4, 5, 6]

#სიის ახალი ელემენტის ჩამატება (ახალი ელემენტი ჩაემატება სიის ბოლოში)
#nums.append("nika")

#სიის ბოლო ელემენტის ინდეგზე წაშლა ელემენტი
#nums.pop()

#სიის ნებისმიერ მე ინდექსზე მდგომი ელემენტი წაშლა, ვუთითებთ ინდექსს
#nums.pop(2)

#სიის ელემენტის ჩამატება რომელიმე ინდექსზე მეთოდის insert(ინდექსი, მნიშვნელობა)
#nums.insert(3, 12)

#სიის ელემენტის მნიშვნელობის ამოშლა რომელიმე პოზიციიდან, მნიშვნელობის გადაცემით
##remove() სიის პირველივე მნიშვნელობას შლის რომელიც სიაში შეხვდება
#nums.remove(4)

#სიის ყველა ელემენტის ამოშლა
#nums.clear()

#index() აბრუნებს პირველივე შეხვედრილი ინდექსს სადაც ეს მნიშვნელობა
#ობიექტი მოცემულ სიაში არსებობს
#print(nums.index(5))

# count() ითვლის, რამდენჯერ გვხვდება კონკრეტული ელემენტი სიაში ან სტრიქონში
# მაგალითად:

#len ამოწმებს სიის სიგრძეს