
#1)მომხმარებელს შემოატანინეთ რიცხვი,შემდეგ შეამოწმეთ -->

#----თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის მეტი 90 ზე დააუპრინტე-->"მაღალი ქულა მიიღე"

#----თუ  მომხმარებლის მიერ შემოტანილი რიცხვი არის 50 ზე მეტი დაუპრინტე --> "საშუალო ქულა მიიღე:

#----თუ  მომხმარებლის მიერ შემოტანილი რიცხვი არის 30 ზე მეტი დაუპრინტე --> "დაბალი ქულა მიიღე:

#----თუ  მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი დაუპრინტე --> "ჩაიჭერი":

#----სხვა დამარჩენ შემთხვევაში დაუპრინტე --> "მეორედ აქ აღარ მოხვიდე"

grade=int(input("enter your grade:"))

if grade >90:
    print ("მაღლი ქულა მიიღე")

elif grade >50:
    print ("საშუალო ქულა მიიღე")

elif grade >30:
    print ("დაბალი ქულა მიიღე")

elif grade >10:
    print ("ჩაიჭერი")

else:
    print ("მეორედ აქ აღარ მოხვიდე")


