#3) მომხმარებელს შემოატანინე:
#--> ტემპერატურა (temp)
#--> არის თუ არა წვიმა (rain) – მომხმარებელმა შეიყვანოს "yes" ან "no"
#შემდეგ შეამოწმე:
#თუ ტემპერატურა მეტია 25-ზე და rain == "no" -> "შესანიშნავი ამინდია სასეირნოდ!"
#თუ ტემპერატურა მეტია 25-ზე და rain == "yes" -> "ცხელი და წვიმიანია, ჩაფხუტი დაგჭირდება!"
#თუ ტემპერატურა ნაკლებია 10-ზე ან rain == "yes" -> "სჯობს სახლში დარჩე"
#სხვა შემთხვევაში -> "სასიამოვნო ამინდია"



temperature = int(input("enter temperature:"))
rain = ("yes or no")

if temperature > 25 and rain == "no":
    print ("შესანიშნავი ამინდია სასეირნოდ")

elif temperature > 25 and rain == "yes":
    print ("ცხელი და წვიმიანია,ჩაფხუტი დაგჭირდება")

elif temperature < 10 and rain == "yes":
    print ("სჯობს სახლში დარჩე")

else:
    print ("სასიამოვნო ამინდია")







