// function myName(){
//     console.log('ალექს აბესაძე')
// }

// myName()

// 2)შენი დავალებაა შექმნა ფუნქცია და გადასცე სამი პარამეტრი(შენი სურვილით) ასევე ამ სამივე პარამეტრს
//  მიანიჭე დეფაულთ მნიშვნელობები , შენი დაალბაა ფუნქციამ დააკონსოლლოგოს რაიმე წინადადება სადაც
//   გამოყენებული იქნება ყველა ეს პარამეტრი , გამოიძახე ფუნქცია ოთხჯერ შემდეგნაირად --> არგუმენტი
//    მიანიჭე მხოლოდ პირველ პარამეტრს და ნახე შედეგი , არგუმენტი მიანშე პირველ და მეორე პარამეტრს და ნახე შედეგი
//     , არგუმენტი მიანიჭე სამივე პარამეტრს
//  და ნახე შედეგი , არგუმენტი არ მიანიჭო არც ერთ პარამეტრს და ნახე შედეგი

function meaning(name = 'Alex' , surname = 'abesadze' , age = '12'){
    console.log(`Hello , my name is ${name} , my surname is ${surname}, and my age is ${age}.`)
}

meaning()