//4)იპოვე შნეი სახელის სიგრძე
console.log("Alex".length)
//5)გადაიყვანე შენი სახელი დიდიდნ პატარა ასოებში და პირიქით პატარიდან დიდში
console.log("ALEX".toLocaleLowerCase())
console.log("alex".toLocaleUpperCase())
//6)შეამოწმე იწყება თუ არა შენი სახელი ასო "g" ზე
console.log("Alex".startsWith("A"))
//7)შექმენი სტრინგი რომელსაც ექნება white spaces ,შენი დავალებაა დაბეჭდო ის სფეისების გარეშე
console.log("         Alex        ".trim())
//8)გვაქვს სტრინგი --> "ჰიდროელექტროსადგური" შენი დავალებაა კონსოლში გამოიტანო -->"ელექტრო" გამოიყენე შესაბამისი მეთოდი
console.log("ჰიდროელექტროსადგური".slice(5 , 12))
