# 2) შექმენით სიტყვებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, ანუ წერია lowercase-ში, ამ სიტყვის ყველა
# ასო გახადეთ დიდი.
# თუ სიტყვა შეიცავს თუნდაც ერთ uppercase ასოს, ეს სიტყვა ამოშალეთ სიიდან. ბოლოს დაპრინტეთ მიღებული სია. (არ
#  შექმნათ ახალი სია, იმუშავეთ იგივე სიტყვების სიაში) გამოიყენეთ while ციკლი.

words1 = [" Hello" , 'my' , 'Name' , 'is' , 'Alex']

i = 0

while i < len(words1):
    if words1[i] == words1[i].lower():
        words1[i] = words1[i].upper()
        i += 1

    else:
        words1.pop(i)

print(words1)

    

    
 


