# 5) შექმენით ფუნქცია. შექმენი რიცხვებით სავსე სია, სადაც დუბლიკატები
# - ანუ გამეორებული ელემენტები აღარ იქნება, მაგრამ ელემენტების თანმიმდევრობა შენარჩუნდეს.
# მაგალითად თუ მოცემული გვქონდა სია: [1, 2, 2, 3, 3, 4, 5, 6, 5], უნდა
# დავპრინტოთ [1, 2, 3, 4, 5, 6]. გამოიყენე for ციკლი და if.
# გამოიძახეთ ფუნქცია.

def function1():
    list1 = [1, 2, 2, 3, 3, 4, 5, 6, 5]
    new_list = []

    for i in list1:
        if i not in list1:
            new_list.append(i)
            
    print(new_list)

function1()
